{
  "name": ["Mohamed Yusuf", "test"],
  "address": ["Egham, Surrey"],
  "phoneNumber": ["+44(0)7955170009"],
  "email": ["mohdgazyanii235@gmail.com", "zjac204@live.rhul.ac.uk"],
  "linkedIn": ["https://www.linkedin.com/in/moyusuf01"],
  "website": ["https://github.com/mohdgazyanii235"],
  "position": ["Graduate Software Engineer", "Junior Java Engineer"],
  "executiveSummary": [
    "5+ years of software engineering experience, specialising in building secure applications using Java, Python and C++",
    "Extremely driven software engineer with over 4 years of expertise in Spring Boot Java, Python Django, and C++, focused on delivering robust solutions with a client-centric approach. I excel in simplifying complex processes, managing risks effectively, and driving innovations that foster efficiency and sustainable impact. Committed to excellence, I embody accountability, collaboration, and continuous improvement in every project."
  ],
  "technicalProficiencies": {
    "Programming Languages": ["Java", "Kotlin", "Python", "JavaScript", "C", "C++", "C#", "Rust", "Typescript", "Go", "Haskell"],
    "Frameworks \\& Libraries": ["Java Spring", "ReactJs", "ReactNative", "NodeJs", "NextJs", "Django", "Flask"],
    "Systems \\& Tools": ["Microsoft Azure", "AWS", "Heroku", "Kubernetes", "Git", "SVN", "Docker", "Redis"]
  },
  "experiences": [
    {
      "companyName": "Royal Holloway University of London",
      "position": ["Computer Science Teaching Assistant"],
      "companyAddress": "Egham, Surrey",
      "startDate": "Sept 23",
      "endDate": "Present",
      "stillWorking": true,
      "description": [
        "Developed and maintained scalable web applications using Java and Spring Boot.",
        "Led a team to design a microservices architecture for a cloud-based solution.",
        "Implemented CI/CD pipelines, reducing deployment time by 50."
      ]
    },
    {
      "companyName": "Royal Holloway Student's Union",
      "position": ["Lead Web Developer"],
      "companyAddress": "Egham, Surrey",
      "startDate": "Sept 23",
      "endDate": "Present",
      "stillWorking": true,
      "description": [
        "Elevated user interfaces, achieving a 40\\% increase in user engagement through expert application of ReactJS, HTML, CSS, and JavaScript. Demonstrated superior front-end development skills and user experience focus.",
        "Led the seamless integration of VCS automation and CI/CD pipelines, enhancing team productivity by 30\\% and ensuring bug-free code with a commitment to TDD principles.",
        "Spearheaded the rapid development and delivery of 5 application iterations within a tight deadline, showcasing agility and responsiveness to organizational needs.",
        "Secured a critical system vulnerability, fortifying web security and safeguarding sensitive data, reflecting a proactive approach to cybersecurity and technical proficiency."
      ]
    },
    {
      "companyName": "Freelance",
      "position": ["Software Engineer"],
      "companyAddress": "Egham, Surrey",
      "startDate": "Oct 20",
      "endDate": "Present",
      "stillWorking": true,
      "description": [
        "Spearheaded the modernization of a retail platform, boosting user engagement by 40\\% with responsive design and personalized recommendations, leveraging ReactJS and AWS. Integrated Flowable for seamless workflow automation.",
        "Developed a HIPAA-compliant appointment system for healthcare, reducing administrative workload by 30\\% and improving patient access. Employed Django and Azure, with Jenkins ensuring flawless CI/CD processes.",
        "Created a fintech data analysis tool, enhancing decision-making through real-time processing and trend analytics. Utilized Flask and Google Cloud, incorporating Activiti for efficient data workflow optimization."
      ]
    },
    {
      "companyName": "Pollinate International Limited",
      "position": ["Junior Software Engineer / Service Management Intern", "Service Management Intern", "Junior Software Engineer"],
      "companyAddress": "London, England",
      "startDate": "July 22",
      "endDate": "Sept 23",
      "stillWorking": false,
      "description": [
        "Slashed service request response time from average of 13 days to 3 hours by developing security approval automation.",
        "Successfully led the development of an observability system for 32 product components to achieve multi-fold performance improvements within 4 months.",
        "Led Apache Kafka integration, boosting transaction throughput by 300\\%, setting a new fintech industry standard.",
        "Worked extensively within the back-end team to deliver important stories using Spring Boot Java and Apache Kafka.",
        "Spearheaded the development of a feature-rich, internal tool that automated the previously manual process of code deployment, reducing the deployment time by 75\\% and significantly increasing the development team's efficiency and productivity."
      ]
    },
    {
      "companyName": "Royal Holloway Information Security Group",
      "position": ["Cybersecurity Research Intern"],
      "companyAddress": "Egham, Surrey",
      "startDate": "June 21",
      "endDate": "Aug 21",
      "stillWorking": false,
      "description": [
        "Successfully led the development of an observability system for 32 product components to achieve multi-fold performance improvements within 4 months.",
        "Conducted security assessments of the widevine.dll file with a systematic approach, identifying and evaluating potential vulnerabilities and demonstrating software engineering knowledge in cybersecurity.",
        "Employed malware analysis tools like Ghidra and IDA Pro, showcasing proficiency in software reverse engineering and data analysis.",
        "Research Paper URL: https://shorturl.at/eyHIO"
      ]
    }
  ],
  "projects": [
    {
      "name": "CV Maker",
      "technologiesUsed": ["Java Spring Boot", "ReactJs", "Free Marker Templating Engine", "Latex"],
      "premise": "The process of tailoring ones CV for different job applications is tedious and time consuming.",
      "description": [
        "Implemented a user-friendly front-end portal for seamless portfolio management and JSON file population.",
        "Enabled dynamic CV content selection, allowing users to tailor their resumes effortlessly for diverse job applications.",
        "Automated PDF CV generation with customizable LaTeX templates, streamlining the resume creation process."
      ]
    },
    {
      "name": "Sudoku Solver",
      "technologiesUsed": ["Python"],
      "premise": "Solving Sudoku puzzles rapidly and accurately with an automated Python solution, bypassing human error and time constraints.",
      "description": [
        "Utilised backtracking to achieve efficient puzzle resolution by systematically exploring all possible solutions for each cell."
      ]
    },
    {
      "name": "Personal Portfolio Website",
      "technologiesUsed": ["ReactJs", "Github Pages"],
      "premise": "Developing an online portfolio to professionally showcase my technological expertise, skill progression, and unique personality, offering a comprehensive insight into my professional journey and personal brand.",
      "description": [
        "Designed and deployed a personal portfolio website leveraging ReactJs for dynamic user interactions and optimized for performance.",
        "Hosted on GitHub Pages for reliable, zero-cost hosting, demonstrating proficiency in deploying and maintaining web content.",
        "Showcased a range of projects, skills, and accomplishments through an engaging, user-friendly interface, enhancing online visibility and professional branding."
      ]
    }
  ],
  "educations": [
    {
      "instituteName": "Royal Holloway University of London",
      "subject": "Computer Science with Information Security",
      "startDate": "Sept 20",
      "endDate": "June 24",
      "grade": "First Class Honours",
      "description": [
        "Received first class result in every exam and assignment held at university.",
        "Awarded the Scholarship of International Leadership",
        "Won runner-up position in the Java coding competition",
        "Selected to be a 'Student Mentor' for first and second year students"
      ]
    },
    {
      "instituteName": "Dubai Scholars Private School",
      "subject": "IT",
      "startDate": "Sept 18",
      "endDate": "June 20",
      "grade": "A",
      "description": [
        "Elected \\textbf{House Captain} and \\textbf{Head of Discipline}",
        "Led and organised 'DS Venturists' an inter-school business competition"
      ]
    }
  ],
  "skills": ["ITSM", "Agile", "Leadership", "Communication"],
  "languages": {
    "Hindi": ["Spoken", "Written", "Read"],
    "English": ["Spoken", "Written", "Read"],
    "Arabic": ["Written", "Read"]
  },
  "certifications": [
    {
      "name": "Problem Solving",
      "issuer": "HackerRank",
      "issueDate": "Nov 23"
    },
    {
      "name": "SQL",
      "issuer": "HackerRank",
      "issueDate": "Nov 23"
    },
    {
      "name": "Rest API",
      "issuer": "HackerRank",
      "issueDate": "Nov 23"
    },
    {
      "name": "Software Engineering",
      "issuer": "HackerRank",
      "issueDate": "Nov 23"
    }
  ]
}
